In [5]:
# import libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
import math
import regex as re

In [6]:
# load dataset

df = pd.read_csv("ds_salaries.csv")

In [7]:
# view dataset head

display(df.head())

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [8]:
# view dataset info

display(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

None

The info output above shows the dataset does not have any missing data

#### We would be using the salary_in_usd column for the analysis of salaries. As a result, the salary and salary_currency columns can be dropped

In [11]:
# drop irrelevant columns

df.drop(['salary','salary_currency'], axis = 1, inplace = True)
display(df)

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,94665,IN,50,IN,L

In [12]:
# view count distribution of job title column

df['job_title'].value_counts()

job_title
Data Engineer                          1040
Data Scientist                          840
Data Analyst                            612
Machine Learning Engineer               289
Analytics Engineer                      103
                                       ...
Principal Machine Learning Engineer       1
Azure Data Engineer                       1
Manager Data Management                   1
Marketing Data Engineer                   1
Finance Data Analyst                      1
Name: count, Length: 93, dtype: int64

In [13]:
# clean job titles with regex

df['job_title'] = df['job_title'].replace(r'.*(Scientist|Science).*', 'Data Scientist', regex=True)

df['job_title'] = df['job_title'].replace(r'.*(Analyst|Analytics).*', 'Data Analyst', regex=True)

df['job_title'] = df['job_title'].replace(r'.*(Data.* Engineer|ETL).*', 'Data Engineer', regex=True)

df['job_title'] = df['job_title'].replace(r'.*(ML.* Engineer|Machine Learning).*', 'Machine Learning Engineer', regex=True)

df['job_title'] = df['job_title'].replace(r'.*(Data Architect).*', 'Data Architect', regex=True)

In [14]:
# view updated count distribution of job title column

df['job_title'].value_counts()

job_title
Data Scientist                       1181
Data Engineer                        1101
Data Analyst                          821
Machine Learning Engineer             375
Data Architect                        105
Research Engineer                      37
Data Manager                           29
Computer Vision Engineer               18
Data Specialist                        14
BI Developer                           13
AI Developer                           11
Head of Data                           10
NLP Engineer                            7
Deep Learning Engineer                  6
Computer Vision Software Engineer       5
3D Computer Vision Researcher           4
Business Intelligence Engineer          4
Data Strategist                         2
Data Modeler                            2
Autonomous Vehicle Technician           2
AI Programmer                           2
Data Lead                               2
Data Management Specialist              1
Deep Learning Researcher                1
Manager Data Management                 1
Power BI Developer                      1
Name: count, dtype: int64

In [15]:
# since autonomous vehicle techincian is not a data science related job title, those rows would be dropped

df.drop(df[df['job_title'] == 'Autonomous Vehicle Technician'].index, inplace = True)

In [16]:
# create list of major job titles

major_jobs = df['job_title'].value_counts()[:5].index

In [17]:
# replace job titles not among the main job titles with 'Others'

df['job_title'] = df['job_title'].apply(lambda x: x if x in major_jobs else 'Others')

In [18]:
# view updated count distribution of job title column

df['job_title'].value_counts()

job_title
Data Scientist               1181
Data Engineer                1101
Data Analyst                  821
Machine Learning Engineer     375
Others                        170
Data Architect                105
Name: count, dtype: int64

In [19]:
#creates a new column with the converted currency using the most recent exchange rate(2/5/2025)
df['salary_in_cad'] = df['salary_in_usd'] * 1.43

In [20]:
#drops the USD column as it is no longer necessary
df.drop(['salary_in_usd'], axis = 1, inplace = True)

In [21]:
#display updated data frame
display(df)

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size,salary_in_cad
0,2023,SE,FT,Data Scientist,ES,100,ES,L,122761.21
1,2023,MI,CT,Machine Learning Engineer,US,100,US,S,42900.00
2,2023,MI,CT,Machine Learning Engineer,US,100,US,S,36465.00
3,2023,SE,FT,Data Scientist,CA,100,CA,M,250250.00
4,2023,SE,FT,Data Scientist,CA,100,CA,M,171600.00
...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,US,100,US,L,589160.00
3751,2021,MI,FT,Data Scientist,US,100,US,L,215930.00
3752,2020,EN,FT,Data Scientist,US,100,US,S,150150.00
3753,2020,EN,CT,Data Analyst,US,100,US,L,143000.00
3754,2021,SE,FT,Data Scientist,IN,50,IN,L,135370.95

In [22]:
#changing the data type of the remote_ratio column 
df = df.astype({'remote_ratio':'object'})

In [23]:
#creating a new column that interprets the remote ratio as In-Person, Hybrid or Fully Remote
df['Remote Status'] = df['remote_ratio'].replace({100:'In-Person',50:'Hybrid',0:'Fully Remote'})

In [24]:
#displaying the updated data frame
display(df)

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size,salary_in_cad,Remote Status
0,2023,SE,FT,Data Scientist,ES,100,ES,L,122761.21,In-Person
1,2023,MI,CT,Machine Learning Engineer,US,100,US,S,42900.00,In-Person
2,2023,MI,CT,Machine Learning Engineer,US,100,US,S,36465.00,In-Person
3,2023,SE,FT,Data Scientist,CA,100,CA,M,250250.00,In-Person
4,2023,SE,FT,Data Scientist,CA,100,CA,M,171600.00,In-Person
...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,US,100,US,L,589160.00,In-Person
3751,2021,MI,FT,Data Scientist,US,100,US,L,215930.00,In-Person
3752,2020,EN,FT,Data Scientist,US,100,US,S,150150.00,In-Person
3753,2020,EN,CT,Data Analyst,US,100,US,L,143000.00,In-Person
3754,2021,SE,FT,Data Scientist,IN,50,IN,L,135370.95,Hybrid

In [51]:
df[(df['company_location'] == 'US') | (df['company_location'] == 'CA')]

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size,salary_in_cad,Remote Status
1,2023,MI,CT,Machine Learning Engineer,US,100,US,S,42900.0,In-Person
2,2023,MI,CT,Machine Learning Engineer,US,100,US,S,36465.0,In-Person
3,2023,SE,FT,Data Scientist,CA,100,CA,M,250250.0,In-Person
4,2023,SE,FT,Data Scientist,CA,100,CA,M,171600.0,In-Person
5,2023,SE,FT,Data Scientist,US,0,US,L,317746.0,Fully Remote
...,...,...,...,...,...,...,...,...,...,...
3749,2021,SE,FT,Others,US,100,US,L,235950.0,In-Person
3750,2020,SE,FT,Data Scientist,US,100,US,L,589160.0,In-Person
3751,2021,MI,FT,Data Scientist,US,100,US,L,215930.0,In-Person
3752,2020,EN,FT,Data Scientist,US,100,US,S,150150.0,In-Person
3753,2020,EN,CT,Data Analyst,US,100,US,L,143000.0,In-Person